#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Tyk/repo-policy-tyk-pump/runs/run-k5gtJ8ux9rdyeJei

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.tyk-pump.github_repository.repository: Refreshing state... [id=tyk-pump]
module.tyk-pump.github_branch.default: Refreshing state... [id=tyk-pump:master]
module.tyk-pump.github_branch.release_branches["release-1.7"]: Refreshing state... [id=tyk-pump:release-1.7]
module.tyk-pump.github_branch.release_branches["master"]: Refreshing state... [id=tyk-pump:master]
module.tyk-pump.github_branch.release_branches["release-1.8"]: Refreshing state... [id=tyk-pump:release-1.8]
module.tyk-pump.github_branch_protection.automerge["release-1.7"]: Refreshing state... [id=BPR_kwDOAwBg2c4B_GSq]
module.tyk-pump.github_branch_protection.automerge["release-1.8"]: Refreshing state... [id=BPR_kwDOAwBg2c4CS279]
module.tyk-pump.github_branch_protection.automerge["master"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTkxOTM5MzE=]
module.tyk-pump.github_branch_default.default: Refreshing state... [id=tyk-pump]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tyk-pump.github_branch.release_branches["release-1.9"] will be created
  + resource "github_branch" "release_branches" {
      + branch        = "release-1.9"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tyk-pump"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.tyk-pump.github_branch_protection.automerge["master"] will be updated in-place
  ~ resource "github_branch_protection" "automerge" {
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTkxOTM5MzE="
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ required_approving_review_count = 0 -> 1
            # (6 unchanged attributes hidden)
        }

      ~ required_status_checks {
          ~ contexts = [
              + "1.21-bullseye",
              + "Go 1.21 tests",
              + "api-tests (murmur64, mongo44)",
              + "api-tests (murmur64, postgres15)",
              + "api-tests (sha256, mongo44)",
              + "api-tests (sha256, postgres15)",
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # module.tyk-pump.github_branch_protection.automerge["release-1.9"] will be created
  + resource "github_branch_protection" "automerge" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "release-1.9"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnk1MDM1NjQ0MQ=="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "1.21-bullseye",
              + "Go 1.21 tests",
              + "api-tests (murmur64, mongo44)",
              + "api-tests (murmur64, postgres15)",
              + "api-tests (sha256, mongo44)",
              + "api-tests (sha256, postgres15)",
            ]
          + strict   = true
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @ermirizio, Action: `pull_request`*